[{"name":"Antelope Valley College","departments":["Mathematics, Sciences and Engineering Division California Aerospace Technologies Institute of Excellence (CATIE)"],"campusLocation":"3041 W Ave K, Lancaster, CA 93536","schoolType":"Public","schoolDescription":"Antelope Valley College is a public institution and community college within the California Community Colleges System. AVC offers associate degree programs, career technical programs, general education courses, and workforce preparation courses. ","accreditation":"Antelope Valley College is accredited by the Accrediting Commission for Community and Junior Colleges (ACCJC)","schoolLogo":"https://cluster-data-sources.s3-us-west-1.amazonaws.com/Antelope+Valley+College+Logo+Resized.png","totalEnrollment":"14408","backgroundColor":"#8d1b3f","gradientColor":["#8D1B3F","#F18904","#8BB8CB"],"engineeringDevisionDescription":"","costPerUnit":"46","programs":[]},{"name":"Long Beach City College","departments":[],"campusLocation":"4901 E Carson St, Long Beach, CA 90808","schoolType":"Public","schoolDescription":"Long Beach City College is a public institution and community college within the California Community Colleges System. LBCC offers associate degree programs, career technical programs, general education courses, and workforce preparation courses. ","accreditation":"Long Beach City College is accredited by the Accrediting Commission for Community and Junior Colleges, Western Association of Schools and Colleges.","schoolLogo":"https://cluster-data-sources.s3-us-west-1.amazonaws.com/LBCC+Seal+BW.jpg","totalEnrollment":"26729","backgroundColor":"#000000","gradientColor":["#000000","#DA291C"],"engineeringDevisionDescription":"","costPerUnit":"46","programs":[]},{"name":"California Institute of Technology","departments":["Graduate Aerospace Laboratories of the California Institute of Technology (GALCIT)"],"campusLocation":"1200 E California Blvd, Pasadena, CA 91125","schoolType":"Private Non-Profit","schoolDescription":"CalTech is a private, independent science and engineering institute and research university emphasizing scientific leadership, with most of its students studying physics, biology, engineering, and mathematical disciplines. Caltech manages the Jet Propulsion Laboratory (JPL) for NASA. ","accreditation":"Caltech receives regional accreditation from WASC Senior College and University Commission (WSCUC).","schoolLogo":"https://cluster-data-sources.s3-us-west-1.amazonaws.com/CalTech+White+on+Orange+Logo+160px.jpg","totalEnrollment":"2233","backgroundColor":"#ff6cc","gradientColor":["#FF6C0C","#76777B","#C8C8C8"],"engineeringDevisionDescription":"Most well known for its influence on the aerospace industry, GALCIT is Caltech’s graduate research department. Currently, the department facilitates students’ and faculty’s research on space science and technology, micro- and nano-mechanics, and biosystems engineering. ","costPerUnit":"","programs":[]},{"name":"California State University Long Beach","departments":["College of Engineering"],"campusLocation":"1250 Bellflower Blvd, Long Beach, CA 90840","schoolType":"Public","schoolDescription":"Cal State Long Beach is a public institution within the California State University system. CSU Long Beach offers four-year degrees, graduate programs, and certificate programs. ","accreditation":"CSULB receives regional accreditation from WASC Senior College and University Commission.","schoolLogo":"https://cluster-data-sources.s3-us-west-1.amazonaws.com/Cal+State+Long+Beach+Seal+Resized+160px.jpg","totalEnrollment":"37500","backgroundColor":"#eba91b","gradientColor":["#EBA91B","#000000"],"engineeringDevisionDescription":"","costPerUnit":"","programs":[]},{"name":"Embry-Riddle Aeronautical University - Worldwide and Online Campus","departments":[],"campusLocation":"1 Aerospace Boulevard, Daytona Beach, FL 32114-3900  3700 Willow Creek Road, Prescott, AZ 86301-3720","schoolType":"Private Non-Profit","schoolDescription":"Embry-Riddle Aeronautical University is a private institution and one of the largest accredited university systems dedicated to aviation and aerospace.","accreditation":"Embry-Riddle Aeronautical University  is accredited by the Southern Association of Colleges and Schools Commission on Colleges.","schoolLogo":"https://cluster-data-sources.s3-us-west-1.amazonaws.com/Embry+Riddle+Logo+160px.jpg","totalEnrollment":"33771","backgroundColor":"#00539f","gradientColor":["#00539F","#A29062"],"engineeringDevisionDescription":"","costPerUnit":"76-1198","programs":[]},{"name":"University of California, Los Angeles","departments":["Henry Samueli School of Engineering and Applied Science"],"campusLocation":"405 Hilgard Avenue, Los Angeles, CA 90095","schoolType":"Public","schoolDescription":"The University of California, Los Angeles is a public research institution within the University of California system. UCLA offers four-year degrees, graduate programs, and certificate programs. ","accreditation":"The University of California, Los Angeles (UCLA) is accredited by the Western Association of Schools and Colleges (WASC).","schoolLogo":"https://cluster-data-sources.s3-us-west-1.amazonaws.com/UCLA+Logo+Blue+Text+on+White+Resized.jpg","totalEnrollment":"45507","backgroundColor":"#2874ae","gradientColor":["#2874AE","#FFD101"],"engineeringDevisionDescription":"UCLA Engineering is named after Dr. Henry Samueli, Ph.D., an alumnus, former professor of the university, and co-founder of Broadcom Corporation. UCLA Engineering emphasizes interdisciplinary research across seven departments: bioengineering, chemical and biomolecular engineering, civil and environmental engineering, computer science, electrical and computer engineering, materials science and engineering, and mechanical and aerospace engineering. ","costPerUnit":"","programs":[]},{"name":"University of Southern California","departments":["Viterbi School of Engineering (USC Viterbi)"],"campusLocation":"3551 Trousdale Pkwy, Los Angeles, CA, 90089","schoolType":"Private Non-Profit","schoolDescription":"University of Southern California is a private research university offering four-year undergraduate degree programs, graduate degree programs, certificate courses.","accreditation":"USC is accredited by the Western Association of Schools and Colleges (WASC)","schoolLogo":"https://cluster-data-sources.s3-us-west-1.amazonaws.com/USC+Logo+Resized.png","totalEnrollment":"44000","backgroundColor":"#990000","gradientColor":["#990000","#FFCC00"],"engineeringDevisionDescription":"Viterbi Engineering is named after Andrew Viterbi, an alumnus of USC, engineer, and co-founder of Qualcomm Inc. Dr. Viterbi is also the inventor of the Viterbi algorithm. USC Viterbi emphasizes bringing together learning theory with practical application to foster innovative engineers. ","costPerUnit":"1928","programs":[]},{"name":"Irvine Valley College","departments":["University of California, Irvine-Irvine Valley College Engineering Academy "],"campusLocation":"5500 Irvine Center Dr, Irvine, CA 92618","schoolType":"Public","schoolDescription":" Irvine Valley College is a public college within the California Community Colleges System and the South Orange County Community College District. IVC offers associate degree programs, career technical programs, general education courses, and workforce preparation courses. ","accreditation":"Irvine Valley College is accredited by the Accrediting Commission for Community and Junior Colleges (ACCJC) of the Western Association of Schools and Colleges (WASC).","schoolLogo":"https://cluster-data-sources.s3-us-west-1.amazonaws.com/IVC+160PX+RESIZED.jpg","totalEnrollment":"23133","backgroundColor":"#004889","gradientColor":["#004889","#B2B3B6"],"engineeringDevisionDescription":"","costPerUnit":"46","programs":[]},{"name":"Orange Coast College","departments":[],"campusLocation":"2701 Fairview Rd, Costa Mesa, CA 92626","schoolType":"Public","schoolDescription":"Saddleback is a public community college located in Mission Viejo, California. OCC offers associate degree programs, career technical programs, general education courses, and workforce preparation courses. ","accreditation":"Saddleback College is accredited by the Accrediting Commission for Community and Junior College, Western Association of Schools and Colleges, ","schoolLogo":"https://cluster-data-sources.s3-us-west-1.amazonaws.com/Orange+Coast+College+Logo+White+Background+Resized.jpg","totalEnrollment":"25000","backgroundColor":"#f79238","gradientColor":["#F79238","#002C69"],"engineeringDevisionDescription":"","costPerUnit":"46","programs":[]},{"name":"Saddleback College","departments":["The Advanced Technology and Applied Science Division"],"campusLocation":"28000 Marguerite Pkwy, Mission Viejo, CA 92692","schoolType":"Public","schoolDescription":"Saddleback College is a public community college within the California Community Colleges System and the South Orange County Community Colleges. Saddleback College offers associate degree programs, career technical programs, general education courses, and workforce preparation courses.","accreditation":"Saddleback College is accredited by Accrediting Commission for Community and Junior Colleges (ACCJC), the branch of Western Association of Schools and Colleges (WASC).","schoolLogo":"https://cluster-data-sources.s3-us-west-1.amazonaws.com/saddleback+college+logo+reszied.png","totalEnrollment":"41968","backgroundColor":"#b3838","gradientColor":["#B30838","#FEC056"],"engineeringDevisionDescription":"","costPerUnit":"46","programs":[]},{"name":"California State University Fullerton","departments":["Department of Engineering & Computer Science Department of Mechanical Engineering Department of Electrical Engineering"],"campusLocation":"800 N State College Blvd, Fullerton, CA 92831","schoolType":"Public","schoolDescription":" Cal State Fullerton is a public institution within the California State University system. CSU Fullerton offers four-year degrees, graduate programs, and certificate programs. ","accreditation":"Cal State Fullerton is accredited by the Western Association of Schools and Colleges Senior College and University Commission (WSCUC)","schoolLogo":"https://cluster-data-sources.s3-us-west-1.amazonaws.com/Cal+State+Fullerton+Stacked+Logo.jpg","totalEnrollment":"39030","backgroundColor":"#003663","gradientColor":["#003663","#F5821F"],"engineeringDevisionDescription":"","costPerUnit":"","programs":[]},{"name":"University of California, Irvine","departments":["Henry Samueli School of Engineering at UC Irvine"],"campusLocation":"University of California Irvine, Irvine, CA 92697-1075","schoolType":"Public","schoolDescription":"The University of California, Irvine is a public research institution within the University of California system. UC Irvine offers four-year degrees, graduate programs, and certificate programs. ","accreditation":"UC Irvine is accredited by the Senior Commission of the Western Association of Schools and Colleges(WSCUC)","schoolLogo":"https://cluster-data-sources.s3-us-west-1.amazonaws.com/UCI+Primary+Logo+Resized.jpg","totalEnrollment":"36742","backgroundColor":"#0064a4","gradientColor":["#0064A4","#FFD200"],"engineeringDevisionDescription":"UCI Samueli School of Engineering is named after Dr. Henry Samueli, Ph.D., a University of California alumnus, former UCI adjunct professor, and co-founder of Broadcom Corporation. UCI Samueli School of Engineering oversees undergraduate and graduate programs in biomedical engineering; chemical and biomolecular engineering; civil and environmental engineering; electrical engineering and computer science; materials science and engineering; and mechanical and aerospace engineering. ","costPerUnit":"","programs":[]},{"name":"University of California, Riverside","departments":["The Marlan and Rosemary Bourns College of Engineering at UC Riverside (BCOE)"],"campusLocation":"900 University Ave, Riverside, CA 92521","schoolType":"Public","schoolDescription":"The University of California, Riverside is a public research institution within the University of California system. UC Riverside offers four-year degrees, graduate programs, and certificate programs. ","accreditation":"The University of California, Riverside is accredited by the Western Association of Schools and Colleges (WASC).","schoolLogo":"https://cluster-data-sources.s3-us-west-1.amazonaws.com/UCR+Updated+Logo+Resized.jpg","totalEnrollment":"23922","backgroundColor":"#2d6cc0","gradientColor":["#2D6CC0","#F1AB00","#393B41"],"engineeringDevisionDescription":"Named after the founders of Bourns, Inc., Bourns Engineering oversees undergraduate and graduate programs bioengineering; chemical and environmental engineering; computer science and engineering; computer engineering, electrical engineering; mechanical engineering and materials science and engineering. Bournes Engineering is well-known for its research centers, most notably the Center for Environmental Research and Technology, the Center for Nanoscale Science and Engineering, and the Center for Research and Intelligent Systems. ","costPerUnit":"","programs":[]},{"name":"San Bernardino Valley College","departments":["Division of Applied Technology, Transportation, and Culinary Arts"],"campusLocation":"701 S Mt Vernon Ave, San Bernardino, CA 92410","schoolType":"Public","schoolDescription":"San Bernardino Valley College is a public community college within the San Bernardino College District. SBVC offers associate degree programs, career technical programs, general education courses, and workforce preparation courses. ","accreditation":"San Bernardino Valley College is fully accredited by the Accrediting Commission for Community and Junior Colleges (ACCJC)","schoolLogo":"https://cluster-data-sources.s3-us-west-1.amazonaws.com/San+Bernardino+Valley+College+Logo+Resized.png","totalEnrollment":"19290","backgroundColor":"#0053a1","gradientColor":["#0053A1","#FFFFFF"],"engineeringDevisionDescription":"The Applied Technology, Transportation, and Culinary Arts division at SBVC oversees programs in aeronautics, electronics, machinist technology, welding technology, and more. ","costPerUnit":"46","programs":[]},{"name":"Glendale Community College","departments":["Technology and Aviation at Glendale Community College"],"campusLocation":"1500 N Verdugo Rd, Glendale, CA 91208","schoolType":"Public","schoolDescription":"Glendale Community College is a public community college within the California Community College System. GCC offers associate degree programs, career technical programs, general education courses, and workforce preparation courses. ","accreditation":"Glendale Community College is accredited by the Accrediting Commission for Community and Junior Colleges, Western Association of Schools and Colleges","schoolLogo":"https://cluster-data-sources.s3-us-west-1.amazonaws.com/Glendale+Community+College+Logo+Resized.png","totalEnrollment":"26597","backgroundColor":"#c7b46","gradientColor":["#C70B46","#A94C0F","#F1B310"],"engineeringDevisionDescription":"The Technology and aviation division at GCC oversees programs in aviation and transportation; computer integrated manufacturing; computer-aided manufacturing and machine technology; engineering; welding and metallurgy; and more.","costPerUnit":"46","programs":[]},{"name":"Loyola Marymount University","departments":["Frank R. Seaver College of Science and Engineering"],"campusLocation":"1 Loyola Marymount University Dr, Los Angeles, CA 90045","schoolType":"Private Non-Profit","schoolDescription":"Loyola Marymount University is a private Jesuit and Marymount research institution offering four-year undergraduate degree programs, graduate degree programs, certificate courses. ","accreditation":"Loyola Marymount University is regionally accredited by the Western Association of Schools and Colleges (WASC).","schoolLogo":"https://cluster-data-sources.s3-us-west-1.amazonaws.com/Loyola+Marymount+University+Logo+Resized.png","totalEnrollment":"9695","backgroundColor":"#abc2f","gradientColor":["#AB0C2F","#107FB8"],"engineeringDevisionDescription":"Named after philanthropist Frank Seaver, Loyola Marymount University’s College of Science and Engineering emphasizes experiential and interdisciplinary learning that prepares students for success after graduation. Graduate education at Seaver College of Science and Engineering is rigorous and innovative to ensure that students learn in the context of the greatest challenges facing society today. ","costPerUnit":"1111","programs":[]},{"name":"Citrus College","departments":[],"campusLocation":"1000 W Foothill Blvd, Glendora, CA 91741","schoolType":"Public","schoolDescription":"Citrus College is a public community college offering associate degree programs, career technical programs, general education courses, and workforce preparation courses. ","accreditation":"​​​​​​​​​​​​​​​Citrus College is accredited by the Accrediting Commission for Community and Junior Colleges (ACCJC), Western Association of Schools and Colleges (WASC). ","schoolLogo":"https://cluster-data-sources.s3-us-west-1.amazonaws.com/Citrus+College+Logo+Resized.png","totalEnrollment":"13263","backgroundColor":"#ff9825","gradientColor":["#FF9825","#006DAB"],"engineeringDevisionDescription":"","costPerUnit":"46","programs":[]},{"name":"College of the Canyons","departments":[],"campusLocation":"26455 Rockwell Canyon Rd, Santa Clarita, CA 91355","schoolType":"Public","schoolDescription":"College of the Canyons is a public community college within the California Community College System. COC offers associate degree programs, career technical programs, general education courses, and workforce preparation courses. ","accreditation":"College of the Canyons is accredited by the Accrediting Commission for Community and Junior Colleges (ACCJC)","schoolLogo":"https://cluster-data-sources.s3-us-west-1.amazonaws.com/college+of+the+canyons+logo+resized.png","totalEnrollment":"17148","backgroundColor":"#003b70","gradientColor":["#003B70","#FFCE00"],"engineeringDevisionDescription":"","costPerUnit":"46","programs":[]},{"name":"California State Polytechnic University, Pomona","departments":["College of Engineering"],"campusLocation":" 3801 W Temple Ave, Pomona, CA 91768","schoolType":"Public","schoolDescription":"The California State Polytechnic University, Pomona is a public institution within the California State University system. Cal Poly Pomona offers four-year degrees, graduate programs, and certificate programs. ","accreditation":"California State Polytechnic University, Pomona is accredited by the Western Association of Schools and Colleges (WASC). ","schoolLogo":"https://cluster-data-sources.s3-us-west-1.amazonaws.com/Cal+Poly+Pomona+Logo+160px+Resized.jpg","totalEnrollment":"25894","backgroundColor":"#38444","gradientColor":["#038444","#FDB813","#0B4269"],"engineeringDevisionDescription":"","costPerUnit":"","programs":[]},{"name":"California State University, Northridge","departments":["Cal State Northridge School of Engineering and Computer Science"],"campusLocation":"18111 Nordhoff St, Northridge, CA 91330","schoolType":"Public","schoolDescription":"Cal State Northridge is a public institution within the California State University system. CSU Northridge offers four-year degrees, graduate programs, and certificate programs. ","accreditation":"CSU Northridge is accredited by the WASC Senior College and University Commission (WSCUC)","schoolLogo":"https://cluster-data-sources.s3-us-west-1.amazonaws.com/CSUN+Official+Logo+Resized.jpg","totalEnrollment":"39816","backgroundColor":"#d22030","gradientColor":["#D22030","#E64B36","#FFFFFF"],"engineeringDevisionDescription":"","costPerUnit":"","programs":[]},{"name":"California State University, Dominguez Hills","departments":[],"campusLocation":"1000 E Victoria St, Carson, CA 90747","schoolType":"Public","schoolDescription":"Cal State Dominguez Hills is a public institution within the California State University system. CSU Dominguez Hills offers four-year degrees, graduate programs, and certificate programs. ","accreditation":"CSU Dominguez Hills is accredited by the Western Association of Schools and Colleges (WASC).","schoolLogo":"https://cluster-data-sources.s3-us-west-1.amazonaws.com/CSU+Dominguez+Logo+Resized.png","totalEnrollment":"14731","backgroundColor":"#860038","gradientColor":["#860038","#EFBA08"],"engineeringDevisionDescription":"","costPerUnit":"","programs":[]},{"name":"California State University, Los Angeles","departments":["College of Engineering, Computer Science, and Technology"],"campusLocation":"5151 State University Dr, Los Angeles, CA 90032","schoolType":"Public","schoolDescription":"Cal State Los Angeles or Cal State LA is a public institution within the California State University system. Cal State LA offers four-year degrees, graduate programs, and certificate programs. ","accreditation":"California State University, Los Angeles is accredited by the Western Association of Schools and Colleges (WASC).","schoolLogo":"https://cluster-data-sources.s3-us-west-1.amazonaws.com/Cal+State+LA+Logo+Resized.jpg","totalEnrollment":"27685","backgroundColor":"#000000","gradientColor":["#000000","#FECE00"],"engineeringDevisionDescription":"","costPerUnit":"320","programs":[]},{"name":"Imperial Valley College","departments":["Industrial Technology Department"],"campusLocation":"80 E Aten Rd, Imperial, CA 92251","schoolType":"Public","schoolDescription":"Imperial Valley College is a public community college in Imperial Valley, CA. IVC offers associate degree programs, career technical programs, general education courses, and workforce preparation courses. ","accreditation":"Imperial Valley College is in the process of receiving an accreditation from the Accreditation Commission on Community and Junior Colleges (ACCJC).","schoolLogo":"https://cluster-data-sources.s3-us-west-1.amazonaws.com/IVC+Logo+Resized+(1).jpg","totalEnrollment":"8449","backgroundColor":"#ed1c24","gradientColor":["#ED1C24","#000000"],"engineeringDevisionDescription":"","costPerUnit":"46","programs":[]},{"name":"Bakersfield College","departments":[],"campusLocation":"1801 Panorama Dr, Bakersfield, CA 93305","schoolType":"Public","schoolDescription":"Bakersfield College is a public community college in the Kern Community College District that offers associate degree programs, career technical programs, general education courses, and workforce preparation courses. ","accreditation":"Bakersfield College is accredited by the Accrediting Commission for Community and Junior Colleges (ACCJC).","schoolLogo":"https://cluster-data-sources.s3-us-west-1.amazonaws.com/bakersfield-college-logo+resized+(png).png","totalEnrollment":"22000","backgroundColor":"#000000","gradientColor":["#000000","#ED1B24"],"engineeringDevisionDescription":"","costPerUnit":"46","programs":[]},{"name":"Cerro Coso Community College","departments":[],"campusLocation":"3000 College Heights Blvd, Ridgecrest, CA 93555","schoolType":"Public","schoolDescription":"Cerro Coso Community College is a public community college within the California Community Colleges system and Kern Community College District. The college offers  in person and online associate degree programs, career technical programs, general education courses, and workforce preparation courses. ","accreditation":"Cerro Coso Community College is accredited by the Accrediting Commission for Community and Junior Colleges (ACCJC).","schoolLogo":"https://cluster-data-sources.s3-us-west-1.amazonaws.com/CerroCoso_Primary_400+Logo.png","totalEnrollment":"4866","backgroundColor":"#00245d","gradientColor":["#00245D","#4A96C8","#B0B7BC"],"engineeringDevisionDescription":"","costPerUnit":"46","programs":[]},{"name":"Taft College","departments":[],"campusLocation":"29 Cougar Ct, Taft, CA 93268","schoolType":"Public","schoolDescription":"Taft College is a public community college within the California Community Colleges System. Taft College offers associate degree programs, career technical programs, general education courses, and workforce preparation courses.","accreditation":"Taft College is accredited by the Accrediting Commission for Community and Junior Colleges (ACCJC).","schoolLogo":"https://cluster-data-sources.s3-us-west-1.amazonaws.com/Taft+College+Seal+Resized.jpg","totalEnrollment":"6260","backgroundColor":"#ebab21","gradientColor":["#EBAB21","#000000"],"engineeringDevisionDescription":"","costPerUnit":"46","programs":[]},{"name":"El Camino College","departments":[],"campusLocation":"16007 Crenshaw Blvd, Torrance, CA 90506","schoolType":"Public","schoolDescription":"El Camino College is a public community college within the California Community Colleges System and El Camino Community College District. El Camino College offers associate degree programs, career technical programs, general education courses, and workforce preparation courses.","accreditation":"El Camino College is accredited by the Accrediting Commission for Community and Junior Colleges (ACCJC).","schoolLogo":"https://cluster-data-sources.s3-us-west-1.amazonaws.com/El+Camino+College+Logo.png","totalEnrollment":"34455","backgroundColor":"#204199","gradientColor":["#204199","#FFFFFF"],"engineeringDevisionDescription":"","costPerUnit":"46","programs":[]},{"name":"Cerritos College","departments":[],"campusLocation":"11110 Alondra Blvd, Norwalk, CA 90650","schoolType":"Public","schoolDescription":"Cerritos College is a public community college within the California Community Colleges System and the Cerritos Community College District. Cerritos College offers associate degree programs, career technical programs, general education courses, and workforce preparation courses.","accreditation":"Cerritos College is accredited by the Accrediting Commission for Community and Junior Colleges (ACCJC).","schoolLogo":"https://cluster-data-sources.s3-us-west-1.amazonaws.com/Cerritos+College+Logo+Resized.jpg","totalEnrollment":"21671","backgroundColor":"#002f66","gradientColor":["#002E66","#FFFFFF"],"engineeringDevisionDescription":"","costPerUnit":"46","programs":[]},{"name":"Compton College","departments":[],"campusLocation":"1111 E. Artesia Boulevard, Compton, 90221","schoolType":"Public","schoolDescription":"Compton College is a public community college within the California Community Colleges System and the Compton Community College District. Compton College offers associate degree programs, career technical programs, general education courses, and workforce preparation courses.","accreditation":"Compton College is accredited by the Accrediting Commission for Community and Junior Colleges (ACCJC).","schoolLogo":"https://cluster-data-sources.s3-us-west-1.amazonaws.com/Compton+College+Resized+Logo.jpg","totalEnrollment":"12205","backgroundColor":"#981b36","gradientColor":["#981B36","#747679"],"engineeringDevisionDescription":"","costPerUnit":"46","programs":[]},{"name":"Los Angeles Pierce College","departments":[],"campusLocation":"6201 Winnetka Ave, Woodland Hills, CA 91371","schoolType":"Public","schoolDescription":"Los Angeles Pierce College is a public community college within the California Community Colleges System and the Los Angeles Community College District. Los Angeles Pierce College offers Bachelor of Applied Sciences programs, associate degree programs, career technical programs, general education courses, and workforce preparation courses.","accreditation":"Los Angeles Pierce College is accredited by the Accrediting Commission for Community and Junior Colleges (ACCJC).","schoolLogo":"https://cluster-data-sources.s3-us-west-1.amazonaws.com/0.jpg","totalEnrollment":"17655","backgroundColor":"#d1231e","gradientColor":["#D1231E","#000000"],"engineeringDevisionDescription":"","costPerUnit":"46","programs":[]},{"name":"Los Angeles Trade Technical College","departments":[],"campusLocation":"400 W Washington Blvd, Los Angeles, CA 90015","schoolType":"Public","schoolDescription":"Los Angeles Trade Technical College is a public community college within the California Community Colleges System and the Los Angeles Community College District. Los Angeles Trade Technical College offers associate degree programs, career technical programs, general education courses, and workforce preparation courses.","accreditation":"Los Angeles Trade-Technical College is accredited by the Accrediting Commission for Community and Junior Colleges (ACCJC)","schoolLogo":"https://cluster-data-sources.s3-us-west-1.amazonaws.com/LATTC+Logo.png","totalEnrollment":"12984","backgroundColor":"#bb2d3d","gradientColor":["#BB2D3D","#000000"],"engineeringDevisionDescription":"","costPerUnit":"46","programs":[]},{"name":"Los Angeles Valley College","departments":[],"campusLocation":"5800 Fulton Ave, Van Nuys, CA 91401","schoolType":"Public","schoolDescription":"Los Angeles Valley College is a public community college within the California Community Colleges System and the Los Angeles Community College District. Los Angeles Valley College offers  associate degree programs, career technical programs, general education courses, and workforce preparation courses.","accreditation":"Los Angeles Valley College is accredited by the Accrediting Commission for Community and Junior Colleges (ACCJC)","schoolLogo":"https://cluster-data-sources.s3-us-west-1.amazonaws.com/LA+Valley+College+Logo.jpg","totalEnrollment":"17243","backgroundColor":"#00361c","gradientColor":["#00361C","#EFA506"],"engineeringDevisionDescription":"","costPerUnit":"46","programs":[]},{"name":"Pasadena City College","departments":[],"campusLocation":"1570 East Colorado Boulevard , Pasadena, 91106","schoolType":"Public","schoolDescription":"Pasadena City College is a public community college within the California Community Colleges System and the Pasadena Area Community College District. The college offers Bachelor of Applied Sciences programs, associate degree programs, career technical programs, general education courses, and workforce preparation courses.","accreditation":"Pasadena City College is accredited by the Accrediting Commission for Community and Junior Colleges (ACCJC).","schoolLogo":"https://cluster-data-sources.s3-us-west-1.amazonaws.com/PCC+Standard+Logo.jpg","totalEnrollment":"30250","backgroundColor":"#a8433","gradientColor":["#A80433","#231F20"],"engineeringDevisionDescription":"","costPerUnit":"46","programs":[]},{"name":"Rio Hondo College","departments":[],"campusLocation":"3600 Workman Mill Rd, Whittier, CA 90601","schoolType":"Public","schoolDescription":"Rio Hondo College is a public community college within the California Community Colleges System and the Rio Hondo Community College District. The college offers associate degree programs, career technical programs, general education courses, and workforce preparation courses.","accreditation":"Rio Hondo College is fully accredited by the Accrediting Commission for Community and Junior Colleges (ACCJC).","schoolLogo":"https://cluster-data-sources.s3-us-west-1.amazonaws.com/Rio+Hondo+College+Logo.jpg","totalEnrollment":"19948","backgroundColor":"#e9c9ae","gradientColor":["#E9C9AE","#D5A073","#AC5C10"],"engineeringDevisionDescription":"","costPerUnit":"46","programs":[]},{"name":"Cypress College","departments":["The School of Career Technical Education"],"campusLocation":"9200 Valley View St, Cypress, CA 90630","schoolType":"Public","schoolDescription":"Cypress College is a public community college within the California Community Colleges System and the North Orange County Community College District. The college offers associate degree programs, career technical programs, general education courses, and workforce preparation courses.","accreditation":"Cypress College is accredited by the Accrediting Commission for Community and Junior Colleges (ACCJC).","schoolLogo":"https://cluster-data-sources.s3-us-west-1.amazonaws.com/Cypress+College+Logo.jpg","totalEnrollment":"16000","backgroundColor":"#63a75","gradientColor":["#063A75","#FED337"],"engineeringDevisionDescription":"","costPerUnit":"46","programs":[]},{"name":"Golden West College","departments":[],"campusLocation":"15744 Goldenwest Street , Huntington Beach, 92647-0592","schoolType":"Public","schoolDescription":"Golden West College is a public community college within the California Community Colleges System and the Coast Community College District. The college offers associate degree programs, career technical programs, general education courses, and workforce preparation courses.","accreditation":"Golden West College is accredited by the Western Association of Schools and Colleges (WASC).","schoolLogo":" Amazon S3/cluster-data-sources/Golden West College Logo.png Golden West College Logo.png Latest version  Overview Properties Permissions Select from Open Download Download as Make public Copy path Copied to clipboard! Owner ops Last modified Dec 2, 2019 11:23:34 AM GMT-0800 Etag 5b2235d65240946737bb8a04f93646c1 Storage class Standard Server-side encryption Size 12.7 KB Key Golden West College Logo.png Object URL https://cluster-data-sources.s3-us-west-1.amazonaws.com/Golden+West+College+Logo.png Operations 0 In progress 1 Success 0 Error","totalEnrollment":"11610","backgroundColor":"#336363","gradientColor":["#336363","#FBE24F"],"engineeringDevisionDescription":"","costPerUnit":"46","programs":[]},{"name":"Santa Ana College","departments":[],"campusLocation":"1530 W. 17th Street , Santa Ana, 92706-3398","schoolType":"Public","schoolDescription":"Santa Ana College is a public community college within the California Community Colleges System and the Rancho Santiago Community College District. The college offers associate degree programs, career technical programs, general education courses, and workforce preparation courses.","accreditation":"Santa Ana College is accredited by the Accrediting Commission for Community and Junior Colleges (ACCJC).","schoolLogo":"https://cluster-data-sources.s3-us-west-1.amazonaws.com/Santa+Ana+College+Logo.png","totalEnrollment":"29590","backgroundColor":"#e51837","gradientColor":["#E51837","#9A0000","#000000"],"engineeringDevisionDescription":"","costPerUnit":"46","programs":[]}]